/*
===題目說明===
輸入一個整數，代表隔壁同學的成績，並輸出其範圍落在哪。
===輸入說明===
輸入一個整數N (0<=N<=100)
===輸出說明===
若該數等於100，輸出分數滿分!
若該數落在80~99，輸出分數落在80~99
若該數落在60~79，輸出分數落在60~79
若該數落在30~59，輸出分數落在30~59
若該數落在0~29，輸出分數落在0~29
*/

#include <stdio.h>

int main()
{
    int n=-1;    
    printf("輸入一個整數N (0<=N<=100)");
    scanf("%d", &n);    
    if(n==100)
    {
        printf("分數滿分!");
    }
    else if(n>=80 && n<=99)
    {
        printf("分數落在80~99");
    }
    else if(n>=60 && n<=79)
    {
        printf("分數落在60~79");
    }
    else if(n>=30 && n<=59)
    {
        printf("分數落在30~59");
    }
    else if(n>=0 && n<=29)
    {
        printf("分數落在0~29");
    }
    else
    {
    	printf("(0<=分數<=100)");
	}
	return 0;
}
